apache/nuttx/arch/arm/src/common/stm32/stm32_hciuart_m3m4_v1.c
/* HCI USART1 constant configuration information */

static const struct hciuart_config_s g_hciusart1_config =
{
  .lower         =
    {
    .rxattach    = hciuart_rxattach,
    .rxenable    = hciuart_rxenable,
    .setbaud     = hciuart_setbaud,
    .read        = hciuart_read,
    .write       = hciuart_write,
    .rxdrain     = hciuart_rxdrain,
    },
  .state         = &g_hciusart1_state,

  .rxbuffer      = g_usart1_rxbuffer,
  .txbuffer      = g_usart1_txbuffer,
#  ifdef CONFIG_STM32_HCIUART1_RXDMA
  .rxdmabuffer   = g_usart1_rxdmabuffer,
#  endif
  .rxbufsize     = CONFIG_STM32_HCIUART1_RXBUFSIZE,
  .txbufsize     = CONFIG_STM32_HCIUART1_TXBUFSIZE,
#  ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  .rxupper       = RXFLOW_UPPER(CONFIG_STM32_HCIUART1_RXBUFSIZE),
  .rxlower       = RXFLOW_LOWER(CONFIG_STM32_HCIUART1_RXBUFSIZE),
#  endif
#  ifdef CONFIG_STM32_HCIUART_RXDMA
  .rxdmachan     = DMAMAP_USART1_RX,
#  endif

  .irq           = STM32_IRQ_USART1,
  .baud          = CONFIG_STM32_HCIUART1_BAUD,
#  if defined(CONFIG_STM32_STM32F33XX)
  .apbclock      = STM32_PCLK1_FREQUENCY, /* Errata 2.5.1 */
#  else
  .apbclock      = STM32_PCLK2_FREQUENCY,
#  endif
  .usartbase     = STM32_USART1_BASE,
  .tx_gpio       = GPIO_USART1_TX,
  .rx_gpio       = GPIO_USART1_RX,
  .cts_gpio      = GPIO_USART1_CTS,
  .rts_gpio      = GPIO_USART1_RTS,
  .lock          = SP_UNLOCKED
};
#endif

/* This describes the state of the STM32 USART2 port. */

#ifdef CONFIG_STM32_USART2_HCIUART
/* I/O buffers */

static uint8_t g_usart2_rxbuffer[CONFIG_STM32_HCIUART2_RXBUFSIZE];
static uint8_t g_usart2_txbuffer[CONFIG_STM32_HCIUART2_TXBUFSIZE];
#  ifdef CONFIG_STM32_HCIUART2_RXDMA
static uint8_t g_usart2_rxdmabuffer[RXDMA_BUFFER_SIZE];
#  endif

/* HCI USART2 variable state information */

static struct hciuart_state_s g_hciusart2_state =
{
  .rxwait = SEM_INITIALIZER(0),
  .txwait = SEM_INITIALIZER(0),
};

/* HCI USART2 constant configuration information */

static const struct hciuart_config_s g_hciusart2_config =
{
  .lower         =
    {
    .rxattach    = hciuart_rxattach,
    .rxenable    = hciuart_rxenable,
    .setbaud     = hciuart_setbaud,
    .read        = hciuart_read,
    .write       = hciuart_write,
    .rxdrain     = hciuart_rxdrain,
    },
  .state         = &g_hciusart2_state,

  .rxbuffer      = g_usart2_rxbuffer,
  .txbuffer      = g_usart2_txbuffer,
#  ifdef CONFIG_STM32_HCIUART2_RXDMA
  .rxdmabuffer   = g_usart2_rxdmabuffer,
#  endif
  .rxbufsize     = CONFIG_STM32_HCIUART2_RXBUFSIZE,
  .txbufsize     = CONFIG_STM32_HCIUART2_TXBUFSIZE,
#  ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  .rxupper       = RXFLOW_UPPER(CONFIG_STM32_HCIUART2_RXBUFSIZE),
  .rxlower       = RXFLOW_LOWER(CONFIG_STM32_HCIUART2_RXBUFSIZE),
#  endif
#  ifdef CONFIG_STM32_HCIUART_RXDMA
  .rxdmachan     = DMAMAP_USART2_RX,
#  endif

  .irq           = STM32_IRQ_USART2,
  .baud          = CONFIG_STM32_HCIUART2_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_USART2_BASE,
  .tx_gpio       = GPIO_USART2_TX,
  .rx_gpio       = GPIO_USART2_RX,
  .cts_gpio      = GPIO_USART2_CTS,
  .rts_gpio      = GPIO_USART2_RTS,
  .lock          = SP_UNLOCKED
};
#endif

/* This describes the state of the STM32 USART3 port. */

#ifdef CONFIG_STM32_USART3_HCIUART
/* I/O buffers */

static uint8_t g_usart3_rxbuffer[CONFIG_STM32_HCIUART3_RXBUFSIZE];
static uint8_t g_usart3_txbuffer[CONFIG_STM32_HCIUART3_TXBUFSIZE];
#  ifdef CONFIG_STM32_HCIUART3_RXDMA
static uint8_t g_usart3_rxdmabuffer[RXDMA_BUFFER_SIZE];
#  endif

/* HCI USART3 variable state information */

static struct hciuart_state_s g_hciusart3_state =
{
  .rxwait = SEM_INITIALIZER(0),
  .txwait = SEM_INITIALIZER(0),
};

/* HCI USART3 constant configuration information */

static const struct hciuart_config_s g_hciusart3_config =
{
  .lower         =
    {
    .rxattach    = hciuart_rxattach,
    .rxenable    = hciuart_rxenable,
    .setbaud     = hciuart_setbaud,
    .read        = hciuart_read,
    .write       = hciuart_write,
    .rxdrain     = hciuart_rxdrain,
    },
  .state         = &g_hciusart3_state,

  .rxbuffer      = g_usart3_rxbuffer,
  .txbuffer      = g_usart3_txbuffer,
#  ifdef CONFIG_STM32_HCIUART3_RXDMA
  .rxdmabuffer   = g_usart3_rxdmabuffer,
#  endif
  .rxbufsize     = CONFIG_STM32_HCIUART3_RXBUFSIZE,
  .txbufsize     = CONFIG_STM32_HCIUART3_TXBUFSIZE,
#  ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  .rxupper       = RXFLOW_UPPER(CONFIG_STM32_HCIUART3_RXBUFSIZE),
  .rxlower       = RXFLOW_LOWER(CONFIG_STM32_HCIUART3_RXBUFSIZE),
#  endif
#  ifdef CONFIG_STM32_HCIUART_RXDMA
  .rxdmachan     = DMAMAP_USART3_RX,
#  endif

  .irq           = STM32_IRQ_USART3,
  .baud          = CONFIG_STM32_HCIUART3_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_USART3_BASE,
  .tx_gpio       = GPIO_USART3_TX,
  .rx_gpio       = GPIO_USART3_RX,
  .cts_gpio      = GPIO_USART3_CTS,
  .rts_gpio      = GPIO_USART3_RTS,
  .lock          = SP_UNLOCKED
};
#endif

/* This describes the state of the STM32 USART6 port. */

#ifdef CONFIG_STM32_USART6_HCIUART
/* I/O buffers */

static uint8_t g_usart6_rxbuffer[CONFIG_STM32_HCIUART6_RXBUFSIZE];
static uint8_t g_usart6_txbuffer[CONFIG_STM32_HCIUART6_TXBUFSIZE];
#  ifdef CONFIG_STM32_HCIUART6_RXDMA
static uint8_t g_usart6_rxdmabuffer[RXDMA_BUFFER_SIZE];
#  endif

/* HCI USART6 variable state information */

static struct hciuart_state_s g_hciusart6_state =
{
  .rxwait = SEM_INITIALIZER(0),
  .txwait = SEM_INITIALIZER(0),
};

/* HCI USART6 constant configuration information */

static const struct hciuart_config_s g_hciusart6_config =
{
  .lower         =
    {
    .rxattach    = hciuart_rxattach,
    .rxenable    = hciuart_rxenable,
    .setbaud     = hciuart_setbaud,
    .read        = hciuart_read,
    .write       = hciuart_write,
    .rxdrain     = hciuart_rxdrain,
    },
  .state         = &g_hciusart6_state,

  .rxbuffer      = g_usart6_rxbuffer,
  .txbuffer      = g_usart6_txbuffer,
#  ifdef CONFIG_STM32_HCIUART6_RXDMA
  .rxdmabuffer   = g_usart6_rxdmabuffer,
#  endif
  .rxbufsize     = CONFIG_STM32_HCIUART6_RXBUFSIZE,
  .txbufsize     = CONFIG_STM32_HCIUART6_TXBUFSIZE,
#  ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  .rxupper       = RXFLOW_UPPER(CONFIG_STM32_HCIUART6_RXBUFSIZE),
  .rxlower       = RXFLOW_LOWER(CONFIG_STM32_HCIUART6_RXBUFSIZE),
#  endif
#  ifdef CONFIG_STM32_HCIUART_RXDMA
  .rxdmachan     = DMAMAP_USART6_RX,
#  endif

  .irq           = STM32_IRQ_USART6,
  .baud          = CONFIG_STM32_HCIUART6_BAUD,
  .apbclock      = STM32_PCLK2_FREQUENCY,
  .usartbase     = STM32_USART6_BASE,
  .tx_gpio       = GPIO_USART6_TX,
  .rx_gpio       = GPIO_USART6_RX,
  .cts_gpio      = GPIO_USART6_CTS,
  .rts_gpio      = GPIO_USART6_RTS,
  .lock          = SP_UNLOCKED
};
#endif

/* This describes the state of the STM32 UART7 port. */

#ifdef CONFIG_STM32_UART7_HCIUART
/* I/O buffers */

