apache/nuttx/arch/arm/src/common/stm32/stm32_hciuart_m3m4_v1.c
static uint8_t g_uart7_rxbuffer[CONFIG_STM32_HCIUART7_RXBUFSIZE];
static uint8_t g_uart7_txbuffer[CONFIG_STM32_HCIUART7_TXBUFSIZE];
#  ifdef CONFIG_STM32_HCIUART7_RXDMA
static uint8_t g_uart7_rxdmabuffer[RXDMA_BUFFER_SIZE];
#  endif

/* HCI UART7 variable state information */

static struct hciuart_state_s g_hciuart7_state =
{
  .rxwait = SEM_INITIALIZER(0),
  .txwait = SEM_INITIALIZER(0),
};

/* HCI UART7 constant configuration information */

static const struct hciuart_config_s g_hciuart7_config =
{
  .lower         =
    {
    .rxattach    = hciuart_rxattach,
    .rxenable    = hciuart_rxenable,
    .setbaud     = hciuart_setbaud,
    .read        = hciuart_read,
    .write       = hciuart_write,
    .rxdrain     = hciuart_rxdrain,
    },
  .state         = &g_hciuart7_state,

  .rxbuffer      = g_uart7_rxbuffer,
  .txbuffer      = g_uart7_txbuffer,
#  ifdef CONFIG_STM32_HCIUART7_RXDMA
  .rxdmabuffer   = g_uart7_rxdmabuffer,
#  endif
  .rxbufsize     = CONFIG_STM32_HCIUART7_RXBUFSIZE,
  .txbufsize     = CONFIG_STM32_HCIUART7_TXBUFSIZE,
#  ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  .rxupper       = RXFLOW_UPPER(CONFIG_STM32_HCIUART7_RXBUFSIZE),
  .rxlower       = RXFLOW_LOWER(CONFIG_STM32_HCIUART7_RXBUFSIZE),
#  endif
#  ifdef CONFIG_STM32_HCIUART_RXDMA
  .rxdmachan     = DMAMAP_UART7_RX,
#  endif

  .irq           = STM32_IRQ_UART7,
  .baud          = CONFIG_STM32_HCIUART7_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_UART7_BASE,
  .tx_gpio       = GPIO_UART7_TX,
  .rx_gpio       = GPIO_UART7_RX,
  .cts_gpio      = GPIO_UART7_CTS,
  .rts_gpio      = GPIO_UART7_RTS,
  .lock          = SP_UNLOCKED
};
#endif

/* This describes the state of the STM32 UART8 port. */

#ifdef CONFIG_STM32_UART8_HCIUART
/* I/O buffers */

static uint8_t g_uart8_rxbuffer[CONFIG_STM32_HCIUART8_RXBUFSIZE];
static uint8_t g_uart8_txbuffer[CONFIG_STM32_HCIUART8_TXBUFSIZE];
#  ifdef CONFIG_STM32_HCIUART8_RXDMA
static uint8_t g_uart8_rxdmabuffer[RXDMA_BUFFER_SIZE];
#  endif

/* HCI UART8 variable state information */

static struct hciuart_state_s g_hciuart8_state =
{
  .rxwait = SEM_INITIALIZER(0),
  .txwait = SEM_INITIALIZER(0),
};

/* HCI UART8 constant configuration information */

static const struct hciuart_config_s g_hciuart8_config =
{
  .lower         =
    {
    .rxattach    = hciuart_rxattach,
    .rxenable    = hciuart_rxenable,
    .setbaud     = hciuart_setbaud,
    .read        = hciuart_read,
    .write       = hciuart_write,
    .rxdrain     = hciuart_rxdrain,
    },
  .state         = &g_hciuart8_state,

  .rxbuffer      = g_uart8_rxbuffer,
  .txbuffer      = g_uart8_txbuffer,
#  ifdef CONFIG_STM32_HCIUART8_RXDMA
  .rxdmabuffer   = g_uart8_rxdmabuffer,
#  endif
  .rxbufsize     = CONFIG_STM32_HCIUART8_RXBUFSIZE,
  .txbufsize     = CONFIG_STM32_HCIUART8_TXBUFSIZE,
#  ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  .rxupper       = RXFLOW_UPPER(CONFIG_STM32_HCIUART8_RXBUFSIZE),
  .rxlower       = RXFLOW_LOWER(CONFIG_STM32_HCIUART8_RXBUFSIZE),
#  endif
#  ifdef CONFIG_STM32_HCIUART_RXDMA
  .rxdmachan     = DMAMAP_UART8_RX,
#  endif

  .irq           = STM32_IRQ_UART8,
  .baud          = CONFIG_STM32_HCIUART8_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_UART8_BASE,
  .tx_gpio       = GPIO_UART8_TX,
  .rx_gpio       = GPIO_UART8_RX,
  .cts_gpio      = GPIO_UART8_CTS,
  .rts_gpio      = GPIO_UART8_RTS,
  .lock          = SP_UNLOCKED
};
#endif

/* This table lets us iterate over the configured USARTs */

static const struct hciuart_config_s * const g_hciuarts[STM32_NUSART] =
{
#ifdef CONFIG_STM32_USART1_HCIUART
  [0] = &g_hciusart1_config,
#endif
#ifdef CONFIG_STM32_USART2_HCIUART
  [1] = &g_hciusart2_config,
#endif
#ifdef CONFIG_STM32_USART3_HCIUART
  [2] = &g_hciusart3_config,
#endif
#ifdef CONFIG_STM32_USART6_HCIUART
  [4] = &g_hciusart6_config,
#endif
#ifdef CONFIG_STM32_UART7_HCIUART
  [5] = &g_hciuart7_config,
#endif
#ifdef CONFIG_STM32_UART8_HCIUART
  [6] = &g_hciuart8_config,
#endif
};

#ifdef CONFIG_PM
static  struct pm_callback_s g_serialcb =
{
  .notify  = hciuart_pm_notify,
  .prepare = hciuart_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: hciuart_getreg32
 ****************************************************************************/

static inline uint32_t
  hciuart_getreg32(const struct hciuart_config_s *config,
                   unsigned int offset)
{
  return getreg32(config->usartbase + offset);
}

/****************************************************************************
 * Name: hciuart_putreg32
 ****************************************************************************/

static inline void hciuart_putreg32(const struct hciuart_config_s *config,
                                    unsigned int offset, uint32_t value)
{
  putreg32(value, config->usartbase + offset);
}

/****************************************************************************
 * Name: hciuart_enableints
 *
 * Description:
 *   Enable interrupts as specified by bits in the 'intset' argument
 *
 *   NOTE: This operation is not atomic.  This function should be called
 *   only from within a critical section.
 *
 ****************************************************************************/

static void hciuart_enableints(const struct hciuart_config_s *config,
                               uint32_t intset)
{
  uint32_t cr1;
  uint32_t cr2;

  /* And restore the interrupt state (see the interrupt enable/usage table
   * above)
   */

  cr1  = hciuart_getreg32(config, STM32_USART_CR1_OFFSET);
  cr1 |= (intset & USART_CR1_USED_INTS);
  hciuart_putreg32(config, STM32_USART_CR1_OFFSET, cr1);

  cr2  = hciuart_getreg32(config, STM32_USART_CR3_OFFSET);
  cr2 |= (intset & USART_CR3_EIE);
  hciuart_putreg32(config, STM32_USART_CR3_OFFSET, cr2);

  wlinfo("CR1 %08" PRIx32 " CR2 %08" PRIx32 "\n", cr1, cr2);
}

/****************************************************************************
 * Name: hciuart_disableints
 *
 * Description:
 *   Disable interrupts as specified by bits in the 'intset' argument
 *
 *   NOTE: This operation is not atomic.  This function should be called
 *   only from within a critical section.
 *
 ****************************************************************************/

static void hciuart_disableints(const struct hciuart_config_s *config,
                                uint32_t intset)
{
  uint32_t cr1;
  uint32_t cr2;

