apache/nuttx/arch/arm/src/common/stm32/stm32_hciuart_m3m4_v1.c
  /* And restore the interrupt state (see the interrupt enable/usage table
   * above)
   */

  cr1  = hciuart_getreg32(config, STM32_USART_CR1_OFFSET);
  cr1 &= ~(intset & USART_CR1_USED_INTS);
  hciuart_putreg32(config, STM32_USART_CR1_OFFSET, cr1);

  cr2  = hciuart_getreg32(config, STM32_USART_CR3_OFFSET);
  cr2 &= ~(intset & USART_CR3_EIE);
  hciuart_putreg32(config, STM32_USART_CR3_OFFSET, cr2);

  wlinfo("CR1 %08" PRIx32 " CR2 %08" PRIx32 "\n", cr1, cr2);
}

/****************************************************************************
 * Name: hciuart_isenabled
 *
 * Description:
 *   Return true if any any of the interrupts specified in the 'intset'
 *   argument are enabled.
 *
 ****************************************************************************/

static bool hciuart_isenabled(const struct hciuart_config_s *config,
                              uint32_t intset)
{
  uint32_t regval;

  /* And restore the interrupt state (see the interrupt enable/usage table
   * above)
   */

  regval  = hciuart_getreg32(config, STM32_USART_CR1_OFFSET);
  regval &= USART_CR1_USED_INTS;
  if ((regval & intset) != 0)
    {
      return true;
    }

  regval  = hciuart_getreg32(config, STM32_USART_CR3_OFFSET);
  regval &= USART_CR3_EIE;
  if ((regval & intset) != 0)
    {
      return true;
    }

  return false;
}

/****************************************************************************
 * Name: hciuart_rxenabled
 *
 * Description:
 *   Check if Rx interrupts are enabled.
 *
 ****************************************************************************/

static inline bool hciuart_rxenabled(const struct hciuart_config_s *config)
{
#ifdef CONFIG_STM32_HCIUART_RXDMA
  const struct hciuart_config_s *state = config->state;

  if (config->rxdmabuffer != NULL)
    {
      return state->rxenabled;
    }
  else
#endif
    {
      return hciuart_isenabled(config, USART_CR1_RXNEIE);
    }
}

/****************************************************************************
 * Name: hciuart_dma_nextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_HCIUART_RXDMA
static int hciuart_dma_nextrx(const struct hciuart_config_s *config)
{
  struct hciuart_state_s *state = config->state;
  size_t dmaresidual;

  dmaresidual = stm32_dmaresidual(state->rxdmastream);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual);
}
#endif

/****************************************************************************
 * Name: hciuart_rxinuse
 *
 * Description:
 *   Return the number of bytes in the Rx buffer
 *
 *   Example:  rxbufsize=4, rxhead = 0, rxtail = 2
 *
 *    +---+---+---+---+
 *    | X | X |   |   |  X = inuse
 *    +---+---+---+---+
 *      |       `- rxtail = 2
 *      `- rxhead = 0
 *
 *    inuse = 2 - 0 = 2
 *
 *   Example:  rxbufsize=4, rxhead = 2, rxtail = 0
 *
 *    +---+---+---+---+
 *    |   |   | X | X |  X = inuse
 *    +---+---+---+---+
 *      |       `- rxhead = 2
 *      `- rxtail = 0
 *
 *    inuse = (0 + 4) - 2 = 2
 *
 ****************************************************************************/

static uint16_t hciuart_rxinuse(const struct hciuart_config_s *config)
{
  struct hciuart_state_s *state;
  size_t inuse;

  DEBUGASSERT(config != NULL && config->state != NULL);
  state = config->state;

  /* Keep track of how much is discarded */

  if (state->rxtail >= state->rxhead)
    {
      inuse = state->rxtail - state->rxhead;
    }
  else
    {
      inuse = (state->rxtail + config->rxbufsize) - state->rxhead;
    }

  wlinfo("inuse %lu\n", (unsigned long)inuse);
  return inuse;
}

/****************************************************************************
 * Name: hciuart_rxflow_enable
 *
 * Description:
 *   Enable software Rx flow control, i.e., deassert the RTS output.  This
 *   will be seen as CTS on the other end of the cable and the HCI UART
 *   device must stop sending data.
 *
 *   NOTE:  RTS is logic low
 *
 ****************************************************************************/

static void hciuart_rxflow_enable(const struct hciuart_config_s *config)
{
#ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  struct hciuart_state_s *state;

  DEBUGASSERT(config != NULL && config->state != NULL);
  state = config->state;

  /* Is Rx flow control already enable? */

  if (!state->rxflow)
    {
      uint16_t inused = hciuart_rxinuse(config);

      if (inused >= config->rxupper)
        {
          wlinfo("Enable RTS flow control\n");

          stm32_gpiowrite(config->rts_gpio, true);
          state->rxflow = true;
        }
    }
#endif
}

/****************************************************************************
 * Name: hciuart_rxflow_disable
 *
 * Description:
 *   Disable software Rx flow control, i.e., assert the RTS output.  This
 *   will be seen as CTS on the other end of the cable and the HCI UART
 *   device can resume sending data.
 *
 *   NOTE:  RTS is logic low
 *
 ****************************************************************************/

static void hciuart_rxflow_disable(const struct hciuart_config_s *config)
{
#ifdef CONFIG_STM32_HCIUART_SW_RXFLOW
  struct hciuart_state_s *state;

  DEBUGASSERT(config != NULL && config->state != NULL);
  state = config->state;

  if (state->rxflow)
    {
      uint16_t inused = hciuart_rxinuse(config);

      if (inused <= config->rxlower)
        {
          wlinfo("Disable RTS flow control\n");

          stm32_gpiowrite(config->rts_gpio, false);
          state->rxflow = false;
        }
    }
#endif
}

/****************************************************************************
 * Name: hciuart_copytorxbuffer
 *
 * Description:
 *   Copy data to the driver Rx buffer.  The source is either the U[S]ART
 *   Rx FIFO or the Rx DMA buffer, depending upon the configuration.
 *
 ****************************************************************************/

static ssize_t hciuart_copytorxbuffer(const struct hciuart_config_s *config)
{
  struct hciuart_state_s *state;
  ssize_t nbytes = 0;
  uint16_t rxhead;
  uint16_t rxtail;
  uint16_t rxnext;
#ifdef CONFIG_STM32_HCIUART_RXDMA
  uint16_t dmatail;
#endif
  uint8_t rxbyte;

