apache/nuttx/arch/arm/src/common/stm32/stm32_hciuart_m3m4_v1.c
  flags = spin_lock_irqsave(&config->lock);
  if (callback == NULL)
    {
      uint32_t intset;

      /* Disable Rx callbacks and detach the Rx callback */

      intset = USART_CR1_RXNEIE | USART_CR3_EIE;
      hciuart_disableints(config, intset);

      state->callback = NULL;
      state->arg      = NULL;
    }

  /* Otherwise, we are attaching */

  else
    {
      state->callback = NULL;
      state->arg      = arg;
      state->callback = callback;
    }

  spin_unlock_irqrestore(&config->lock, flags);
}

/****************************************************************************
 * Name: hciuart_rxenable
 *
 * Description:
 *   Enable/disable RX callbacks from the HCI UART.
 *
 *   hciuart_rxenable() may be used to enable or disable callback events.
 *   This probably translates to enabling and disabled Rx interrupts at
 *   the UART.  NOTE:  Rx event notification should be done sparingly:
 *   Rx data overrun may occur when Rx events are disabled!
 *
 ****************************************************************************/

static void hciuart_rxenable(const struct btuart_lowerhalf_s *lower,
                             bool enable)
{
  const struct hciuart_config_s *config =
    (const struct hciuart_config_s *)lower;

  DEBUGASSERT(config != NULL && config->state != NULL);

#ifdef CONFIG_STM32_HCIUART_RXDMA
  struct hciuart_state_s *state = config->state;

  if (config->rxdmabuffer != NULL)
    {
      wlinfo("config %p enable %u (DMA)\n", config, enable);

      /* En/disable DMA reception.
       *
       * Note that it is not safe to check for available bytes and
       * immediately pass them to uart_recvchars as that could potentially
       * recurse back to us again.  Instead, bytes must wait until the next
       * up_dma_poll or DMA event.
       */

      state->rxenable = enable;
    }
  else
#else
    {
      uint32_t intset;
      irqstate_t flags;

      wlinfo("config %p enable %u (non-DMA)\n", config, enable);

      /* USART receive interrupts:
       *
       * Enable           Status        Meaning                 Usage
       * ---------------- ------------- ----------------------- ----------
       * USART_CR1_IDLEIE USART_SR_IDLE Idle Line Detected      (not used)
       * USART_CR1_RXNEIE USART_SR_RXNE Received Data Ready to
       *                                be Read
       * "              " USART_SR_ORE  Overrun Error Detected
       * USART_CR1_PEIE   USART_SR_PE   Parity Error            (No parity)
       *
       * USART_CR2_LBDIE  USART_SR_LBD  Break Flag              (not used)
       * USART_CR3_EIE    USART_SR_FE   Framing Error
       * "           "    USART_SR_NE   Noise Error
       * "           "    USART_SR_ORE  Overrun Error Detected
       */

      flags = spin_lock_irqsave(&config->lock);
      if (enable)
        {
          /* Receive an interrupt when their is anything in the Rx data
           * register (or an Rx timeout occurs).
           */

          intset = USART_CR1_RXNEIE | USART_CR3_EIE;
          hciuart_enableints(config, intset);
        }
      else
        {
          intset = USART_CR1_RXNEIE | USART_CR3_EIE;
          hciuart_disableints(config, intset);
        }

      spin_unlock_irqrestore(&config->lock, flags);
    }
#endif
}

/****************************************************************************
 * Name: hciuart_setbaud
 *
 * Description:
 *   The HCI UART comes up with some initial BAUD rate.  Some support
 *   auto-BAUD detection, some support writing a configuration file to
 *   select the initial BAUD.  The simplest strategy, however, is simply
 *   to use the HCI UART's default initial BAUD to perform the basic
 *   bring up, then send a vendor-specific command to increase the HCI
 *   UARTs BAUD.  This method then may be used to adjust the lower half
 *   driver to the new HCI UART BAUD.
 *
 ****************************************************************************/

static int hciuart_setbaud(const struct btuart_lowerhalf_s *lower,
                           uint32_t baud)
{
  const struct hciuart_config_s *config =
    (const struct hciuart_config_s *)lower;

  DEBUGASSERT(config != NULL && config->state != NULL);

  config->state->baud = baud;
  hciuart_line_configure(config);
  return OK;
}

/****************************************************************************
 * Name: hciuart_read
 *
 * Description:
 *   Read UART data.
 *
 *   hciuart_read() after receipt of a callback notifying the upper half of
 *   the availability of Rx frame, the upper half may call the receive()
 *   method in order to obtain the buffered Rx frame data.
 *
 ****************************************************************************/

static ssize_t hciuart_read(const struct btuart_lowerhalf_s *lower,
                            void *buffer, size_t buflen)
{
  const struct hciuart_config_s *config =
    (const struct hciuart_config_s *)lower;
  struct hciuart_state_s *state;
  uint8_t *dest;
  size_t remaining;
  ssize_t ntotal;
  ssize_t nbytes;
  bool rxenable;
  int ret;

  wlinfo("config %p buffer %p buflen %lu\n",
         config, buffer, (unsigned long)buflen);

  /* NOTE:  This assumes that the caller has exclusive access to the Rx
   * buffer, i.e., one lower half instance can server only one upper half!
   */

  DEBUGASSERT(config != NULL && config->state != NULL);
  state = config->state;

  /* Read any pending data to the Rx buffer */

  nbytes = hciuart_copytorxbuffer(config);
  UNUSED(nbytes);

  /* Loop copying data to the user buffer while the Rx buffer is not empty
   * and the callers buffer is not full.
   */

  dest      = (uint8_t *)buffer;
  remaining = buflen;
  ntotal    = 0;

  rxenable  = hciuart_rxenabled(config);
  hciuart_rxenable(lower, false);

  while (state->rxtail != state->rxhead && ntotal < buflen)
    {
      nbytes = hciuart_copyfromrxbuffer(config, dest, remaining);
      if (nbytes <= 0)
        {
          DEBUGASSERT(nbytes == 0);

          /* If no data has been received, then we must wait for the arrival
           * of new Rx data and try again.
           */

