apache/nuttx/arch/arm/src/common/stm32/stm32_hciuart_m3m4_v1.c
  config = g_hciuarts[(int)uart];
  if (config == NULL)
    {
      wlerr("ERROR: UART%d not configured\n", uart + 1);
      return NULL;
    }

  /* Register to receive power management callbacks */

#ifdef CONFIG_PM
  ret = pm_register(&g_serialcb);
  DEBUGASSERT(ret == OK);
  UNUSED(ret);
#endif

  /* Configure and enable the UART */

  hciuart_configure(config);
  return &config->lower;
}

/****************************************************************************
 * Name: hciuart_initialize
 *
 * Description:
 *   Performs the low-level, one-time USART initialization.  This must be
 *   called before hciuart_instantiate.
 *
 ****************************************************************************/

void hciuart_initialize(void)
{
  const struct hciuart_config_s *config;
  struct hciuart_state_s *state;
  int ret;
  int i;

  /* Configure all USARTs */

  for (i = 0; i < STM32_NUSART; i++)
    {
      config = g_hciuarts[i];
      if (config != NULL)
        {
          state = config->state;

          wlinfo("Initializing HCIUART%d\n", i + 1);

          /* Disable U[S]ART interrupts */

          hciuart_disableints(config, HCIUART_ALLINTS);

          /* Attach and enable the HCI UART IRQ */

          ret = irq_attach(config->irq, hciuart_interrupt, (void *)config);
          if (ret == OK)
            {
              /* Enable the interrupt (RX and TX interrupts are still
               * disabled in the USART)
               */

              up_enable_irq(config->irq);
            }
        }
    }
}

/****************************************************************************
 * Name: stm32_serial_dma_poll
 *
 * Description:
 *   Checks receive DMA buffers for received bytes that have not accumulated
 *   to the point where the DMA half/full interrupt has triggered.
 *
 *   This function should be called from a timer or other periodic context.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_HCIUART_RXDMA
void stm32_serial_dma_poll(void)
{
#ifdef CONFIG_STM32_HCIUART1_RXDMA
  hciuart_dma_rxcallback(g_hciusart1_config.state->rxdmastream, 0,
                    &g_hciusart1_config);
#endif

#ifdef CONFIG_STM32_HCIUART2_RXDMA
  hciuart_dma_rxcallback(g_hciusart2_config.state->rxdmastream, 0,
                        &g_hciusart2_config);
#endif

#ifdef CONFIG_STM32_HCIUART3_RXDMA
  hciuart_dma_rxcallback(g_hciusart3_config.state->rxdmastream, 0,
                    &g_hciusart3_config);
#endif

#ifdef CONFIG_STM32_HCIUART6_RXDMA
  hciuart_dma_rxcallback(g_hciusart6_config.state->rxdmastream, 0,
                    &g_hciusart6_config);
#endif

#ifdef CONFIG_STM32_HCIUART7_RXDMA
  hciuart_dma_rxcallback(g_hciuart7_config.state->rxdmastream,
                          0,
                          &g_hciuart7_config);
#endif

#ifdef CONFIG_STM32_HCIUART8_RXDMA
  hciuart_dma_rxcallback(g_hciuart8.state->rxdmastream, 0,
                    &g_hciuart8_config);
#endif
}
#endif
